Tekla.Structures.ModelInternal.dotPhase_t
Serialization structure for the Set phase method

Tekla.Structures.ModelInternal.dotPhase_t.PhaseManipulationType
The phase manipulation type

Tekla.Structures.ModelInternal.dotPhase_t.Id
ID of the part whose phase we wish to set/get
If set to 0 struct is used to get phase information

Tekla.Structures.ModelInternal.dotPhase_t.PhaseNumber
The phase number

Tekla.Structures.ModelInternal.dotPhase_t.PhaseName
The phase name.

Tekla.Structures.ModelInternal.dotPhase_t.PhaseComment
The phase comment.

Tekla.Structures.ModelInternal.dotPhase_t.IsCurrentPhase
Tells whether the phase is current or not.

Tekla.Structures.ModelInternal.dotPhase_t.Result
The result of the phase change (true or false).